#!/bin/sh
set -eu

######################################################################
# 設定
######################################################################

tdir=~/Tools
ddir="${tdir}/download"
idir="${tdir}/install"

######################################################################
# 事前準備
######################################################################

mkdir -p "$ddir"
mkdir -p "$idir"

######################################################################
# 本体処理
######################################################################

# shellshoccar
cd "$ddir"
git clone https://github.com/ShellShoccar-jpn/installer.git shellshoccar
cd shellshoccar
sh shellshoccar.sh --prefix="${idir}/shellshoccar" install
